pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes_set_current_address.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//        File 'pic18_intermediate_classes_set_current_address.cpp'          *
//                        Generated by version 2.4.7                         *
//                       july 6th, 2013, at 9h58'39"                         *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_intermediate_classes_set_current_address.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_intermediate_classes_set_current_address.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//    Category method '@pic18_intermediate_instruction setCurrentAddress'    *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_setCurrentAddress (const PMSInt32 inClassIndex,
                                            categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_setCurrentAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                           GALGAS_uint & io_ioCurrentAddress,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioCurrentAddress, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                         GALGAS_uint & ioArgument_ioCurrentAddress,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction temp_0 = object ;
  ioArgument_ioCurrentAddress = ioArgument_ioCurrentAddress.add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) temp_0.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (7)), inCompiler COMMA_SOURCE_FILE_AT_LINE (7)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress (void) {
  enterCategoryMethod_setCurrentAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress,
                                                                                         freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_ORG setCurrentAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_setCurrentAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                           GALGAS_uint & ioArgument_ioCurrentAddress,
                                                                                           C_Compiler * /* inCompiler */
                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
  ioArgument_ioCurrentAddress = object->mAttribute_mOrigin ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_setCurrentAddress (void) {
  enterCategoryMethod_setCurrentAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_setCurrentAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_setCurrentAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_setCurrentAddress, NULL) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


